# **Pandas (Day-1)**

In [1]:
# import libraries
import pandas as pd

In [2]:
# check pandas version
pd.__version__

'2.2.3'

In [3]:
# read the data
df = pd.read_csv('./data/data.csv')
df.head()

,PROVINCE,DIVISION,DISTRICT,SUB DIVISION,AREA (sq.km),ALL SEXES (RURAL),MALE (RURAL),FEMALE (RURAL),TRANSGENDER (RURAL),SEX RATIO (RURAL),...,POPULATION 1998 (RURAL),ANNUAL GROWTH RATE (RURAL),ALL SEXES (URBAN),MALE (URBAN),FEMALE (URBAN),TRANSGENDER (URBAN),SEX RATIO (URBAN),AVG HOUSEHOLD SIZE (URBAN),POPULATION 1998 (URBAN),ANNUAL GROWTH RATE (URBAN)
0,PUNJAB,BAHAWALPUR DIVISION,BAHAWALNAGAR DISTRICT,BAHAWALNAGAR TEHSIL,1729.0,619550,316864,302644,42,104.70,...,407768,2.22,193840,98391,95402,47,103.13,6.02,133785,1.97
1,PUNJAB,BAHAWALPUR DIVISION,BAHAWALNAGAR DISTRICT,CHISHTIAN TEHSIL,1500.0,540342,273788,266500,54,102.73,...,395983,1.65,149424,75546,73851,27,102.30,6.01,102287,2.01
2,PUNJAB,BAHAWALPUR DIVISION,BAHAWALNAGAR DISTRICT,FORT ABBAS TEHSIL,2536.0,361240,182655,178541,44,102.30,...,250959,1.93,61528,31360,30150,18,104.01,6.00,34637,3.06
3,PUNJAB,BAHAWALPUR DIVISION,BAHAWALNAGAR DISTRICT,HAROONABAD TEHSIL,1295.0,382115,192278,189808,29,101.30,...,297343,1.33,142600,71345,71236,19,100.15,6.02,84424,2.79
4,PUNJAB,BAHAWALPUR DIVISION,BAHAWALNAGAR DISTRICT,MINCHINABAD TEHSIL,1818.0,452723,231506,221178,39,104.67,...,316593,1.90,72294,36694,35590,10,103.10,6.34,37668,3.48

In [4]:
# write the data
df.to_excel('data.xlsx', index=False)

In [5]:
#pip install openpyxl

In [6]:
# reading the excel file
df_xl = pd.read_excel('data.xlsx',sheet_name='Sheet1')

# Pandas tips

In [7]:
# Print the variable or data in terminal
print(df)

     PROVINCE                   DIVISION                   DISTRICT  \
0      PUNJAB        BAHAWALPUR DIVISION      BAHAWALNAGAR DISTRICT
1      PUNJAB        BAHAWALPUR DIVISION      BAHAWALNAGAR DISTRICT
2      PUNJAB        BAHAWALPUR DIVISION      BAHAWALNAGAR DISTRICT
3      PUNJAB        BAHAWALPUR DIVISION      BAHAWALNAGAR DISTRICT
4      PUNJAB        BAHAWALPUR DIVISION      BAHAWALNAGAR DISTRICT
..        ...                        ...                        ...
523  KPK/FATA  DERA ISMAIL KHAN DIVISION  SOUTH WAZIRISTAN DISTRICT
524  KPK/FATA  DERA ISMAIL KHAN DIVISION  SOUTH WAZIRISTAN DISTRICT
525  KPK/FATA  DERA ISMAIL KHAN DIVISION  SOUTH WAZIRISTAN DISTRICT
526  KPK/FATA  DERA ISMAIL KHAN DIVISION  SOUTH WAZIRISTAN DISTRICT
527  KPK/FATA  DERA ISMAIL KHAN DIVISION  SOUTH WAZIRISTAN DISTRICT

            SUB DIVISION  AREA (sq.km)  ALL SEXES (RURAL)  MALE (RURAL)  \
0    BAHAWALNAGAR TEHSIL        1729.0             619550        316864
1       CHISHTIAN TEHSIL        1500.0             540342        273788
2      FORT ABBAS TEHSIL        2536.0             361240        182655
3      HAROONABAD TEHSIL        1295.0             382115        192278
4     MINCHINABAD TEHSIL        1818.0             452723        231506
..                   ...           ...                ...           ...
523     SARAROGHA TEHSIL         813.0              98180         51479
524      SERWEKAI TEHSIL         398.0              54540         28695
525        TIARZA TEHSIL         734.0              45156         23649
526    TOI KHULLA TEHSIL         567.0              50413         27462
527          WANA TEHSIL        2315.0             153156         81342

     FEMALE (RURAL)  TRANSGENDER (RURAL)  SEX RATIO (RURAL)  ...  \
0            302644                   42             104.70  ...
1            266500                   54             102.73  ...
2            178541                   44             102.30  ...
3            189808                   29             101.30  ...
4            221178                   39             104.67  ...
..              ...                  ...                ...  ...
523           46694                    7             110.25  ...
524           25844                    1             111.03  ...
525           21507                    0             109.96  ...
526           22947                    4             119.68  ...
527           71796                   18             113.30  ...

     POPULATION 1998 (RURAL)  ANNUAL GROWTH RATE (RURAL)  ALL SEXES (URBAN)  \
0                     407768                        2.22             193840
1                     395983                        1.65             149424
2                     250959                        1.93              61528
3                     297343                        1.33             142600
4                     316593                        1.90              72294
..                       ...                         ...                ...
523                    72063                        1.64                  0
524                    31472                        2.93                  0
525                    37708                        0.95                  0
526                    36508                        1.71                  0
527                    90772                        2.79                  0

     MALE (URBAN)  FEMALE (URBAN)  TRANSGENDER (URBAN)  SEX RATIO (URBAN)  \
0           98391           95402                   47             103.13
1           75546           73851                   27             102.30
2           31360           30150                   18             104.01
3           71345           71236                   19             100.15
4           36694           35590                   10             103.10
..            ...             ...                  ...                ...
523             0               0                    0               0.00
524             0               0                    0               0.00
525             0               0                    0               0.00
526             0               0                    0               0.00
527             0               0                    0               0.00

     AVG HOUSEHOLD SIZE (URBAN)  POPULATION 1998 (URBAN)  \
0                          6.02                   133785
1                          6.01                   102287
2                          6.00                    34637
3                          6.02                    84424
4                          6.34                    37668
..                          ...                      ...
523                        0.00                        0
524                        0.00                        0
525                        0.00                        0
526                        0.00                        0
527                        0.00                        0

     ANNUAL GROWTH RATE (URBAN)
0                          1.97
1                          2.01
2                          3.06
3                          2.79
4                          3.48
..                          ...
523                        0.00
524                        0.00
525                        0.00
526                        0.00
527                        0.00

[528 rows x 21 columns]

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 528 entries, 0 to 527
Data columns (total 21 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   PROVINCE                    528 non-null    object
 1   DIVISION                    528 non-null    object
 2   DISTRICT                    528 non-null    object
 3   SUB DIVISION                528 non-null    object
 4   AREA (sq.km)                528 non-null    float64
 5   ALL SEXES (RURAL)           528 non-null    int64
 6   MALE (RURAL)                528 non-null    int64
 7   FEMALE (RURAL)              528 non-null    int64
 8   TRANSGENDER (RURAL)         528 non-null    int64
 9   SEX RATIO (RURAL)           528 non-null    float64
 10  AVG HOUSEHOLD SIZE (RURAL)  528 non-null    float64
 11  POPULATION 1998 (RURAL)     528 non-null    int64
 12  ANNUAL GROWTH RATE (RURAL)  528 non-null    float64
 13  ALL SEXES (URBAN)           528 non-null    int64
 14  MALE (URBAN)                528 non-null    int64
 15  FEMALE (URBAN)              528 non-null    int64
 16  TRANSGENDER (URBAN)         528 non-null    int64
 17  SEX RATIO (URBAN)           528 non-null    float64
 18  AVG HOUSEHOLD SIZE (URBAN)  528 non-null    float64
 19  POPULATION 1998 (URBAN)     528 non-null    int64
 20  ANNUAL GROWTH RATE (URBAN)  528 non-null    float64
dtypes: float64(7), int64(10), object(4)
memory usage: 86.8+ KB

In [9]:
df.dtypes

PROVINCE                       object
DIVISION                       object
DISTRICT                       object
SUB DIVISION                   object
AREA (sq.km)                  float64
ALL SEXES (RURAL)               int64
MALE (RURAL)                    int64
FEMALE (RURAL)                  int64
TRANSGENDER (RURAL)             int64
SEX RATIO (RURAL)             float64
AVG HOUSEHOLD SIZE (RURAL)    float64
POPULATION 1998 (RURAL)         int64
ANNUAL GROWTH RATE (RURAL)    float64
ALL SEXES (URBAN)               int64
MALE (URBAN)                    int64
FEMALE (URBAN)                  int64
TRANSGENDER (URBAN)             int64
SEX RATIO (URBAN)             float64
AVG HOUSEHOLD SIZE (URBAN)    float64
POPULATION 1998 (URBAN)         int64
ANNUAL GROWTH RATE (URBAN)    float64
dtype: object

In [10]:
df.tail()

,PROVINCE,DIVISION,DISTRICT,SUB DIVISION,AREA (sq.km),ALL SEXES (RURAL),MALE (RURAL),FEMALE (RURAL),TRANSGENDER (RURAL),SEX RATIO (RURAL),...,POPULATION 1998 (RURAL),ANNUAL GROWTH RATE (RURAL),ALL SEXES (URBAN),MALE (URBAN),FEMALE (URBAN),TRANSGENDER (URBAN),SEX RATIO (URBAN),AVG HOUSEHOLD SIZE (URBAN),POPULATION 1998 (URBAN),ANNUAL GROWTH RATE (URBAN)
523,KPK/FATA,DERA ISMAIL KHAN DIVISION,SOUTH WAZIRISTAN DISTRICT,SARAROGHA TEHSIL,813.0,98180,51479,46694,7,110.25,...,72063,1.64,0,0,0,0,0.0,0.0,0,0.0
524,KPK/FATA,DERA ISMAIL KHAN DIVISION,SOUTH WAZIRISTAN DISTRICT,SERWEKAI TEHSIL,398.0,54540,28695,25844,1,111.03,...,31472,2.93,0,0,0,0,0.0,0.0,0,0.0
525,KPK/FATA,DERA ISMAIL KHAN DIVISION,SOUTH WAZIRISTAN DISTRICT,TIARZA TEHSIL,734.0,45156,23649,21507,0,109.96,...,37708,0.95,0,0,0,0,0.0,0.0,0,0.0
526,KPK/FATA,DERA ISMAIL KHAN DIVISION,SOUTH WAZIRISTAN DISTRICT,TOI KHULLA TEHSIL,567.0,50413,27462,22947,4,119.68,...,36508,1.71,0,0,0,0,0.0,0.0,0,0.0
527,KPK/FATA,DERA ISMAIL KHAN DIVISION,SOUTH WAZIRISTAN DISTRICT,WANA TEHSIL,2315.0,153156,81342,71796,18,113.30,...,90772,2.79,0,0,0,0,0.0,0.0,0,0.0

In [11]:
df.describe()

,AREA (sq.km),ALL SEXES (RURAL),MALE (RURAL),FEMALE (RURAL),TRANSGENDER (RURAL),SEX RATIO (RURAL),AVG HOUSEHOLD SIZE (RURAL),POPULATION 1998 (RURAL),ANNUAL GROWTH RATE (RURAL),ALL SEXES (URBAN),MALE (URBAN),FEMALE (URBAN),TRANSGENDER (URBAN),SEX RATIO (URBAN),AVG HOUSEHOLD SIZE (URBAN),POPULATION 1998 (URBAN),ANNUAL GROWTH RATE (URBAN)
count,528.000000,5.280000e+02,5.280000e+02,5.280000e+02,528.000000,528.000000,528.000000,5.280000e+02,528.000000,5.280000e+02,5.280000e+02,5.280000e+02,528.000000,528.000000,528.000000,5.280000e+02,528.000000
mean,1492.005871,2.462780e+05,1.252757e+05,1.209841e+05,18.174242,98.982614,6.277064,1.674280e+05,3.124792,1.408635e+05,7.284339e+04,6.799787e+04,22.276515,75.411269,4.406402,8.014457e+04,1.920814
std,2039.453778,2.711898e+05,1.375630e+05,1.337169e+05,25.522248,26.812660,2.074947,1.783890e+05,9.577872,3.512463e+05,1.823492e+05,1.688725e+05,66.068127,49.687341,2.948336,2.023120e+05,2.098908
min,0.000000,0.000000e+00,0.000000e+00,0.000000e+00,0.000000,0.000000,0.000000,0.000000e+00,0.000000,0.000000e+00,0.000000e+00,0.000000e+00,0.000000,0.000000,0.000000,0.000000e+00,0.000000
25%,425.000000,5.093450e+04,2.712725e+04,2.397900e+04,1.000000,101.105000,5.700000,3.527350e+04,1.440000,0.000000e+00,0.000000e+00,0.000000e+00,0.000000,0.000000,0.000000,0.000000e+00,0.000000
50%,882.000000,1.652410e+05,8.413450e+04,8.204400e+04,10.000000,105.285000,6.310000,1.172065e+05,2.030000,4.325450e+04,2.198000e+04,2.099900e+04,3.000000,103.195000,5.755000,2.129800e+04,1.855000
75%,1734.250000,3.129112e+05,1.605022e+05,1.522190e+05,25.000000,108.347500,7.200000,2.130542e+05,2.812500,1.178148e+05,6.030175e+04,5.746525e+04,19.000000,107.040000,6.340000,6.542225e+04,2.985000
max,18374.000000,2.297375e+06,1.172995e+06,1.124167e+06,213.000000,139.380000,12.430000,1.044035e+06,100.000000,3.653616e+06,1.905921e+06,1.746900e+06,795.000000,297.810000,10.060000,2.075867e+06,19.780000

# Find the index of the row with the maximum value in a specific column

In [12]:
df['AREA (sq.km)'].describe().max()

np.float64(18374.0)

In [13]:
df['AREA (sq.km)'].idxmax()

10

In [14]:
df.describe().loc['max', 'AREA (sq.km)']

np.float64(18374.0)

In [15]:
df[df['AREA (sq.km)']==df['AREA (sq.km)'].max()]

,PROVINCE,DIVISION,DISTRICT,SUB DIVISION,AREA (sq.km),ALL SEXES (RURAL),MALE (RURAL),FEMALE (RURAL),TRANSGENDER (RURAL),SEX RATIO (RURAL),...,POPULATION 1998 (RURAL),ANNUAL GROWTH RATE (RURAL),ALL SEXES (URBAN),MALE (URBAN),FEMALE (URBAN),TRANSGENDER (URBAN),SEX RATIO (URBAN),AVG HOUSEHOLD SIZE (URBAN),POPULATION 1998 (URBAN),ANNUAL GROWTH RATE (URBAN)
10,PUNJAB,BAHAWALPUR DIVISION,BAHAWALPUR DISTRICT,YAZMAN TEHSIL,18374.0,564422,288761,275612,49,104.77,...,385770,2.02,48883,24884,23995,4,103.7,6.18,21028,4.53

# Indexing & Selecting Data

In [16]:
df.loc[10]

PROVINCE                                   PUNJAB
DIVISION                      BAHAWALPUR DIVISION
DISTRICT                      BAHAWALPUR DISTRICT
SUB DIVISION                        YAZMAN TEHSIL
AREA (sq.km)                              18374.0
ALL SEXES (RURAL)                          564422
MALE (RURAL)                               288761
FEMALE (RURAL)                             275612
TRANSGENDER (RURAL)                            49
SEX RATIO (RURAL)                          104.77
AVG HOUSEHOLD SIZE (RURAL)                   6.41
POPULATION 1998 (RURAL)                    385770
ANNUAL GROWTH RATE (RURAL)                   2.02
ALL SEXES (URBAN)                           48883
MALE (URBAN)                                24884
FEMALE (URBAN)                              23995
TRANSGENDER (URBAN)                             4
SEX RATIO (URBAN)                           103.7
AVG HOUSEHOLD SIZE (URBAN)                   6.18
POPULATION 1998 (URBAN)                     21028
ANNUAL GROWTH RATE (URBAN)                   4.53
Name: 10, dtype: object

In [17]:
df.iloc[10:40:2]

,PROVINCE,DIVISION,DISTRICT,SUB DIVISION,AREA (sq.km),ALL SEXES (RURAL),MALE (RURAL),FEMALE (RURAL),TRANSGENDER (RURAL),SEX RATIO (RURAL),...,POPULATION 1998 (RURAL),ANNUAL GROWTH RATE (RURAL),ALL SEXES (URBAN),MALE (URBAN),FEMALE (URBAN),TRANSGENDER (URBAN),SEX RATIO (URBAN),AVG HOUSEHOLD SIZE (URBAN),POPULATION 1998 (URBAN),ANNUAL GROWTH RATE (URBAN)
10,PUNJAB,BAHAWALPUR DIVISION,BAHAWALPUR DISTRICT,YAZMAN TEHSIL,18374.0,564422,288761,275612,49,104.77,...,385770,2.02,48883,24884,23995,4,103.70,6.18,21028,4.53
12,PUNJAB,BAHAWALPUR DIVISION,RAHIM YAR KHAN DISTRICT,LIAQUATPUR TEHSIL,3262.0,982018,500742,481157,119,104.07,...,666127,2.06,51888,26238,25637,13,102.34,6.34,32858,2.43
14,PUNJAB,BAHAWALPUR DIVISION,RAHIM YAR KHAN DISTRICT,SADIQABAD TEHSIL,2964.0,999966,516640,483247,79,106.91,...,613429,2.60,261622,133215,128365,42,103.78,6.44,159119,2.65
16,PUNJAB,D.G.KHAN DIVISION,DERA GHAZI KHAN DISTRICT,DERA GHAZI KHAN TEHSIL,2012.0,827602,410429,417124,49,98.39,...,522388,2.45,397362,201554,195775,33,102.95,7.29,190542,3.94
18,PUNJAB,D.G.KHAN DIVISION,DERA GHAZI KHAN DISTRICT,TAUNSA TEHSIL,2769.0,580592,300077,280483,32,106.99,...,327387,3.06,97193,50363,46828,2,107.55,6.89,38297,5.01
20,PUNJAB,D.G.KHAN DIVISION,LAYYAH DISTRICT,LAYYAH TEHSIL,1712.0,783612,398960,384606,46,103.73,...,485182,2.55,193476,98457,94988,31,103.65,6.21,105860,3.22
22,PUNJAB,D.G.KHAN DIVISION,MUZAFFARGARH DISTRICT,JATOI TEHSIL,1010.0,555795,285241,270521,33,105.44,...,393772,1.83,159382,81219,78150,13,103.93,5.95,52774,5.98
24,PUNJAB,D.G.KHAN DIVISION,MUZAFFARGARH DISTRICT,MUZAFFARGARH TEHSIL,2377.0,1385109,711866,673133,110,105.75,...,842563,2.65,240378,124916,115424,38,108.22,6.37,140303,2.87
26,PUNJAB,D.G.KHAN DIVISION,RAJANPUR DISTRICT,JAMPUR TEHSIL,2322.0,739299,377811,361435,53,104.53,...,417338,3.05,110090,55953,54121,16,103.39,6.92,67713,2.59
28,PUNJAB,D.G.KHAN DIVISION,RAJANPUR DISTRICT,ROJHAN TEHSIL,2905.0,391144,204450,186658,36,109.53,...,197433,3.66,14545,7487,7056,2,106.11,7.38,11130,1.42
30,PUNJAB,FAISALABAD DIVISION,CHINIOT DISTRICT,CHINIOT TEHSIL,709.0,277268,141800,135447,21,104.69,...,210354,1.46,278528,143956,134539,33,107.00,6.52,172522,2.55
32,PUNJAB,FAISALABAD DIVISION,FAISALABAD DISTRICT,CHAK JHUMRA TEHSIL,654.0,284170,143009,141136,25,101.33,...,221695,1.31,48796,24664,24123,9,102.24,6.12,32111,2.22
34,PUNJAB,FAISALABAD DIVISION,FAISALABAD DISTRICT,FAISALABAD SADAR TEHSIL,1186.0,1425154,730729,694280,145,105.25,...,900984,2.44,39873,20160,19713,0,102.27,6.56,23126,2.90
36,PUNJAB,FAISALABAD DIVISION,FAISALABAD DISTRICT,SAMMUNDRI TEHSIL,754.0,486176,245494,240637,45,102.02,...,453729,0.36,156938,78834,78084,20,100.96,6.39,54908,5.67
38,PUNJAB,FAISALABAD DIVISION,JHANG DISTRICT,18-HAZARI TEHSIL,1566.0,268160,135653,132487,20,102.39,...,200036,1.55,27554,14039,13513,2,103.89,6.27,0,0.00

# Data Cleaning

In [18]:
# Handling Missing Data
import seaborn as sns
df = sns.load_dataset('penguins')
df.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 344 entries, 0 to 343
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   species            344 non-null    object
 1   island             344 non-null    object
 2   bill_length_mm     342 non-null    float64
 3   bill_depth_mm      342 non-null    float64
 4   flipper_length_mm  342 non-null    float64
 5   body_mass_g        342 non-null    float64
 6   sex                333 non-null    object
dtypes: float64(4), object(3)
memory usage: 18.9+ KB

In [20]:
# Finding the missing values in data
df.isnull().sum()

species               0
island                0
bill_length_mm        2
bill_depth_mm         2
flipper_length_mm     2
body_mass_g           2
sex                  11
dtype: int64

In [21]:
# Filling missing values
df['sex']= df['sex'].fillna(df['sex'].mode()[0])

In [22]:
# dropping missing values
df.dropna(inplace=True)

In [23]:
# Data type conversion
df['body_mass_g'] = df['body_mass_g'].astype('int')

In [24]:
# Removing duplicates
df = df.drop_duplicates()

# Data Manipulation & Analysis

In [25]:
# grouping and aggregation tools
print(df.groupby('species')['island'].value_counts())
df.groupby('species')['island'].unique()

species    island
Adelie     Dream         56
           Torgersen     51
           Biscoe        44
Chinstrap  Dream         68
Gentoo     Biscoe       123
Name: count, dtype: int64

species
Adelie       [Torgersen, Biscoe, Dream]
Chinstrap                       [Dream]
Gentoo                         [Biscoe]
Name: island, dtype: object

In [26]:
# Crosstable
from IPython.display import display

display(pd.crosstab(df['species'], df['island']))
display(pd.crosstab(df['species'], df['sex']))

island     Biscoe  Dream  Torgersen
species
Adelie         44     56         51
Chinstrap       0     68          0
Gentoo        123      0          0

sex        Female  Male
species
Adelie         73    78
Chinstrap      34    34
Gentoo         58    65

In [27]:
df.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800,Female
2,Adelie,Torgersen,40.3,18.0,195.0,3250,Female
4,Adelie,Torgersen,36.7,19.3,193.0,3450,Female
5,Adelie,Torgersen,39.3,20.6,190.0,3650,Male

In [28]:
df['sex'] = df['sex'].str.replace('Male','men').astype(object)

In [29]:
df['sex'].unique()

array(['men', 'Female'], dtype=object)

In [30]:
print(pd.pivot_table(
    data=df,
    index='sex',
    columns='species',
    values='body_mass_g',   # any column (even numeric dummy)
    aggfunc='count'
))

pd.pivot_table(
    data=df,
    index='sex',
    columns='species',
    values='body_mass_g',
    aggfunc='mean'
)

species  Adelie  Chinstrap  Gentoo
sex
Female       73         34      58
men          78         34      65

species       Adelie    Chinstrap       Gentoo
sex
Female   3368.835616  3527.205882  4679.741379
men      4011.217949  3938.970588  5429.615385

In [31]:
df.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750,men
1,Adelie,Torgersen,39.5,17.4,186.0,3800,Female
2,Adelie,Torgersen,40.3,18.0,195.0,3250,Female
4,Adelie,Torgersen,36.7,19.3,193.0,3450,Female
5,Adelie,Torgersen,39.3,20.6,190.0,3650,men

In [32]:
pd.melt(df)

     variable   value
0     species  Adelie
1     species  Adelie
2     species  Adelie
3     species  Adelie
4     species  Adelie
...       ...     ...
2389      sex  Female
2390      sex  Female
2391      sex     men
2392      sex  Female
2393      sex     men

[2394 rows x 2 columns]

In [33]:
342*7

2394

## Leftover Pandas

## 01-How to find the version

In [34]:
import pandas as pd
pd.__version__

'2.2.3'

In [35]:
# more ways
pd.show_versions()

INSTALLED VERSIONS
------------------
commit                : 0691c5cf90477d3503834d983f69350f250a6ff7
python                : 3.13.2
python-bits           : 64
OS                    : Windows
OS-release            : 10
Version               : 10.0.19045
machine               : AMD64
processor             : AMD64 Family 25 Model 80 Stepping 0, AuthenticAMD
byteorder             : little
LC_ALL                : None
LANG                  : None
LOCALE                : English_India.1252

pandas                : 2.2.3
numpy                 : 2.2.4
pytz                  : 2025.2
dateutil              : 2.9.0.post0
pip                   : 25.0
Cython                : None
sphinx                : None
IPython               : 9.0.0
adbc-driver-postgresql: None
adbc-driver-sqlite    : None
bs4                   : 4.13.3
blosc                 : None
bottleneck            : None
dataframe-api-compat  : None
fastparquet           : None
fsspec                : None
html5lib              : None
hypothesis            : None
gcsfs                 : None
jinja2                : 3.1.6
lxml.etree            : None
matplotlib            : 3.10.1
numba                 : None
numexpr               : None
odfpy                 : None
openpyxl              : 3.1.5
pandas_gbq            : None
psycopg2              : None
pymysql               : None
pyarrow               : None
pyreadstat            : None
pytest                : None
python-calamine       : None
pyxlsb                : None
s3fs                  : None
scipy                 : 1.15.2
sqlalchemy            : None
tables                : None
tabulate              : None
xarray                : None
xlrd                  : None
xlsxwriter            : None
zstandard             : None
tzdata                : 2025.2
qtpy                  : None
pyqt5                 : None

## 02- Make a dataframe

In [36]:
print(pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],columns=['A','B','C'])) #via list
df=pd.DataFrame({'a':[1,2,3],'b':[4,5,6],'c':[7,8,9]}) # via dict
df

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

## Via Numpy array

In [37]:
# numpy array dataframe
import numpy as np
arr = np.array([[1,2,3],[4,5,6],[7,8,9]])
print(arr)
pd.DataFrame(arr, columns=['A','B','C'])

[[1 2 3]
 [4 5 6]
 [7 8 9]]

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [38]:
pd.DataFrame(np.random.rand(4,8))

,0,1,2,3,4,5,6,7
0,0.877491,0.650021,0.236966,0.385702,0.874965,0.474078,0.762243,0.433663
1,0.281418,0.463547,0.070504,0.016889,0.810023,0.716700,0.405450,0.642899
2,0.744051,0.543617,0.975156,0.253626,0.690494,0.075207,0.898368,0.745054
3,0.832963,0.131451,0.012481,0.694433,0.931560,0.884652,0.538809,0.556410

In [39]:
pd.DataFrame(np.random.rand(4,8), columns=list('ABCDEFGH'))

,A,B,C,D,E,F,G,H
0,0.494595,0.179865,0.868305,0.554125,0.558119,0.060187,0.565486,0.698632
1,0.578043,0.167520,0.001737,0.381461,0.147214,0.441952,0.341037,0.712253
2,0.700173,0.228709,0.583155,0.994022,0.322417,0.574409,0.294707,0.962241
3,0.426725,0.116131,0.986943,0.109691,0.772954,0.540671,0.241282,0.745093

## How to Rename Columns

In [40]:
df.rename(columns={'a':'A','b':'B','c':'C'}, axis=1, inplace=True)
df

TypeError: Cannot specify both 'axis' and any of 'index' or 'columns'

In [ ]:
df.columns=['A_col','B_col','C_col']
df

   A_col  B_col  C_col
0      1      4      7
1      2      5      8
2      3      6      9

In [ ]:
# to replace any character,string
df.columns = df.columns.str.replace('_col','-column')
df

   A-column  B-column  C-column
0         1         4         7
1         2         5         8
2         3         6         9

In [ ]:
df = df.add_prefix('baba_')
df

   baba_A-column  baba_B-column  baba_C-column
0              1              4              7
1              2              5              8
2              3              6              9

In [ ]:
df = df.add_suffix('baba_')
df

   baba_A-columnbaba_  baba_B-columnbaba_  baba_C-columnbaba_
0                   1                   4                   7
1                   2                   5                   8
2                   3                   6                   9

## Using template data

In [47]:
import pandas as pd
import numpy as np
import seaborn as sns

ti = sns.load_dataset('titanic')
ti.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [48]:
# summary
ti.describe()

#  column names
ti.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [50]:
# saving a dataset
ti.to_csv('tips_save.csv')
ti.to_excel('tips_save.xlsx')

## Using your own data

In [ ]:
import pandas as pd
df = pd.read_csv('tips_save.csv')